# Scribus 1.7.2 macOS ARM64 development/build dependencies.
# Install with: brew bundle --file=Brewfile

brew "cmake"
brew "ninja"
brew "ccache"
brew "pkg-config"
brew "git"
brew "subversion"

brew "qt"
brew "python@3.12"

brew "cairo"
brew "freetype"
brew "fontconfig"
brew "harfbuzz"
brew "hunspell"
brew "icu4c"
brew "jpeg-turbo"
brew "libpng"
brew "libtiff"
brew "little-cms2"
brew "libxml2"
brew "boost"
brew "poppler"
brew "podofo"
brew "librevenge"

# Optional importers discovered during the current successful configure.
brew "libcdr"
brew "libfreehand"
brew "libpagemaker"
brew "libmspub"
brew "libvisio"
